<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame对象" data-toc-modified-id="DataFrame对象-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame对象</a></span><ul class="toc-item"><li><span><a href="#什么是DataFrame对象" data-toc-modified-id="什么是DataFrame对象-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>什么是DataFrame对象</a></span></li><li><span><a href="#DataFrame对象的创建" data-toc-modified-id="DataFrame对象的创建-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>DataFrame对象的创建</a></span><ul class="toc-item"><li><span><a href="#pd.DataFrame(data,-index,-columns)" data-toc-modified-id="pd.DataFrame(data,-index,-columns)-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>pd.DataFrame(data, index, columns)</a></span><ul class="toc-item"><li><span><a href="#data是一个字典" data-toc-modified-id="data是一个字典-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>data是一个字典</a></span></li><li><span><a href="#data是一个二维数组" data-toc-modified-id="data是一个二维数组-1.2.1.2"><span class="toc-item-num">1.2.1.2&nbsp;&nbsp;</span>data是一个二维数组</a></span></li></ul></li></ul></li><li><span><a href="#DataFrame对象的一些常用属性和方法" data-toc-modified-id="DataFrame对象的一些常用属性和方法-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>DataFrame对象的一些常用属性和方法</a></span><ul class="toc-item"><li><span><a href="#df.shape查看形状" data-toc-modified-id="df.shape查看形状-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>df.shape查看形状</a></span></li><li><span><a href="#df.index查看行索引" data-toc-modified-id="df.index查看行索引-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>df.index查看行索引</a></span></li><li><span><a href="#df.columns查看列名称" data-toc-modified-id="df.columns查看列名称-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>df.columns查看列名称</a></span></li><li><span><a href="#df.head()" data-toc-modified-id="df.head()-1.3.4"><span class="toc-item-num">1.3.4&nbsp;&nbsp;</span>df.head()</a></span></li><li><span><a href="#df.tail()" data-toc-modified-id="df.tail()-1.3.5"><span class="toc-item-num">1.3.5&nbsp;&nbsp;</span>df.tail()</a></span></li><li><span><a href="#df.info()查看数据的字段的具体信息" data-toc-modified-id="df.info()查看数据的字段的具体信息-1.3.6"><span class="toc-item-num">1.3.6&nbsp;&nbsp;</span>df.info()查看数据的字段的具体信息</a></span></li><li><span><a href="#df.describe()描述性统计查看" data-toc-modified-id="df.describe()描述性统计查看-1.3.7"><span class="toc-item-num">1.3.7&nbsp;&nbsp;</span>df.describe()描述性统计查看</a></span></li><li><span><a href="#df.set_index(列名)" data-toc-modified-id="df.set_index(列名)-1.3.8"><span class="toc-item-num">1.3.8&nbsp;&nbsp;</span>df.set_index(列名)</a></span></li><li><span><a href="#df.reset_index()" data-toc-modified-id="df.reset_index()-1.3.9"><span class="toc-item-num">1.3.9&nbsp;&nbsp;</span>df.reset_index()</a></span></li><li><span><a href="#df.sort_index()按照索引进行排序" data-toc-modified-id="df.sort_index()按照索引进行排序-1.3.10"><span class="toc-item-num">1.3.10&nbsp;&nbsp;</span>df.sort_index()按照索引进行排序</a></span></li><li><span><a href="#df.sort_values()--按照值进行排序" data-toc-modified-id="df.sort_values()--按照值进行排序-1.3.11"><span class="toc-item-num">1.3.11&nbsp;&nbsp;</span>df.sort_values()  按照值进行排序</a></span></li><li><span><a href="#df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行" data-toc-modified-id="df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行-1.3.12"><span class="toc-item-num">1.3.12&nbsp;&nbsp;</span>df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行</a></span></li><li><span><a href="#df.isnull()/df.isna()查看缺失值情况" data-toc-modified-id="df.isnull()/df.isna()查看缺失值情况-1.3.13"><span class="toc-item-num">1.3.13&nbsp;&nbsp;</span>df.isnull()/df.isna()查看缺失值情况</a></span></li><li><span><a href="#df.duplicated()" data-toc-modified-id="df.duplicated()-1.3.14"><span class="toc-item-num">1.3.14&nbsp;&nbsp;</span>df.duplicated()</a></span></li><li><span><a href="#df.fillna()缺失值填充" data-toc-modified-id="df.fillna()缺失值填充-1.3.15"><span class="toc-item-num">1.3.15&nbsp;&nbsp;</span>df.fillna()缺失值填充</a></span></li><li><span><a href="#df.apply()" data-toc-modified-id="df.apply()-1.3.16"><span class="toc-item-num">1.3.16&nbsp;&nbsp;</span>df.apply()</a></span></li><li><span><a href="#df.applymap()" data-toc-modified-id="df.applymap()-1.3.17"><span class="toc-item-num">1.3.17&nbsp;&nbsp;</span>df.applymap()</a></span></li></ul></li></ul></li></ul></div>

In [1]:
#全部行都能输出
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

# DataFrame对象

## 什么是DataFrame对象

DataFrame是一个可以包含不同数据类型的列的二维数据结构，  
类似于电子表格或SQL表，**是最常用的pandas对象**。

## DataFrame对象的创建

### pd.DataFrame(data, index, columns)

#### data是一个字典

In [3]:
#使用包含列表的字典创建DataFrame时,各个列表内元素个数必须一致
data = {'人物姓名':['小明','小高','小婉'],   #默认字典的键为dataframe的字段名,不设定索引的时候,自动给出默认索引,从0到len(list)-1
         '语文':[88,90,67],
         '数学':[60,40,100],
         '英语':[78, 89, 87]
         }
data

{'人物姓名': ['小明', '小高', '小婉'],
 '语文': [88, 90, 67],
 '数学': [60, 40, 100],
 '英语': [78, 89, 87]}

In [4]:
df = pd.DataFrame(data)
df

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

#### data是一个二维数组  
pd.DataFrame(data, index, columns)  
data作为值  
index作为行索引  
columns作为列索引

In [5]:
#把一个二维数组转化为一个DataFrame
a = np.random.randint(60, 100, (10, 6))
a

array([[80, 72, 68, 77, 64, 80],
       [97, 78, 89, 80, 75, 74],
       [80, 79, 72, 99, 90, 77],
       [93, 92, 71, 66, 75, 90],
       [73, 78, 81, 84, 60, 94],
       [96, 64, 93, 97, 80, 69],
       [96, 87, 99, 67, 89, 88],
       [97, 79, 80, 71, 60, 76],
       [67, 96, 66, 86, 65, 67],
       [99, 73, 64, 88, 79, 81]])

In [6]:
pd.DataFrame(a)  # 行和列自动从零开始补

    0   1   2   3   4   5
0  80  72  68  77  64  80
1  97  78  89  80  75  74
2  80  79  72  99  90  77
3  93  92  71  66  75  90
4  73  78  81  84  60  94
5  96  64  93  97  80  69
6  96  87  99  67  89  88
7  97  79  80  71  60  76
8  67  96  66  86  65  67
9  99  73  64  88  79  81

In [7]:
df = pd.DataFrame(a, index=['A'+i for i in '0123456789'], columns=['语文', '数学', '英语', '物理', '化学', '生物']) 
df

    语文  数学  英语  物理  化学  生物
A0  80  72  68  77  64  80
A1  97  78  89  80  75  74
A2  80  79  72  99  90  77
A3  93  92  71  66  75  90
A4  73  78  81  84  60  94
A5  96  64  93  97  80  69
A6  96  87  99  67  89  88
A7  97  79  80  71  60  76
A8  67  96  66  86  65  67
A9  99  73  64  88  79  81

## DataFrame对象的一些常用属性和方法

### df.shape查看形状

In [8]:
df = pd.DataFrame({'人物姓名':['小明','小高','小婉'],   #默认字典的键为dataframe的字段名,不设定索引的时候,自动给出默认索引,从0到len(list)-1
         '语文':[88,90,67],
         '数学':[60,40,100],
         '英语':[78, 89, 87]
         })
df

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

### df.index查看行索引

In [43]:
df.index

RangeIndex(start=0, stop=3, step=1)

### df.columns查看列名称

In [44]:
df.columns

Index(['人物姓名', '语文', '数学', '英语'], dtype='object')

### df.head()

In [45]:
df.head(2)  # 显示最开始的指定行， 默认是5行

  人物姓名  语文  数学  英语
0   小明  88  60  78
1   小高  90  40  89

### df.tail()

In [46]:
df.tail(2)  # 显示最后的几行， 默认是5行

  人物姓名  语文   数学  英语
1   小高  90   40  89
2   小婉  67  100  87

### df.info()查看数据的字段的具体信息

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   人物姓名    3 non-null      object
 1   语文      3 non-null      int64
 2   数学      3 non-null      int64
 3   英语      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

### df.describe()描述性统计查看

df.describe(percentiles=None, include=None, exclude=None)  
- percentiles=None, 指定统计的百分位数， 默认是[.25, .5, .75]， 也可以自己指定， 0-1之间即可， 只统计数值型字段  
- include=None, 统计哪些列， 默认是只统计数值型字段， 想所有都统计就传入'all',只想统计数值型字段可以默认什么都不写， 也可以传入numpy.number,              只想统计非数值型， 可以传入numpy.object。对于非数值型统计的是`count``, ``unique``, ``top``, and ``freq`

In [53]:
df.describe(percentiles=[0.1, 0.2, 0.5, 0.75, 0.8])  # 默认对数值型字段进行统计

              语文          数学         英语
count   3.000000    3.000000   3.000000
mean   81.666667   66.666667  84.666667
std    12.741010   30.550505   5.859465
min    67.000000   40.000000  78.000000
10%    71.200000   44.000000  79.800000
20%    75.400000   48.000000  81.600000
50%    88.000000   60.000000  87.000000
75%    89.000000   80.000000  88.000000
80%    89.200000   84.000000  88.200000
max    90.000000  100.000000  89.000000

In [60]:
df.describe(include=np.object)

       人物姓名
count     3
unique    3
top      小婉
freq      1

In [61]:
df.describe(include='all').T

     count unique  top freq     mean      std  min   25%  50%  75%  max
人物姓名     3      3   小婉    1      NaN      NaN  NaN   NaN  NaN  NaN  NaN
语文       3    NaN  NaN  NaN  81.6667   12.741   67  77.5   88   89   90
数学       3    NaN  NaN  NaN  66.6667  30.5505   40    50   60   80  100
英语       3    NaN  NaN  NaN  84.6667  5.85947   78  82.5   87   88   89

### df.set_index(列名)  
把该列设置为索引

In [62]:
df

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [63]:
df.set_index('人物姓名')

      语文   数学  英语
人物姓名
小明    88   60  78
小高    90   40  89
小婉    67  100  87

### df.reset_index()

In [64]:
df.reset_index()  # 原来的索引变成普通的一列

   index 人物姓名  语文   数学  英语
0      0   小明  88   60  78
1      1   小高  90   40  89
2      2   小婉  67  100  87

In [65]:
df.reset_index(drop=True)  # 重置索引的同时并删除原来的索引

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

### df.sort_index()按照索引进行排序

In [66]:
df

  人物姓名  语文   数学  英语
0   小明  88   60  78
1   小高  90   40  89
2   小婉  67  100  87

In [67]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [68]:
df.index = ['003', '001', '002']

In [69]:
df

    人物姓名  语文   数学  英语
003   小明  88   60  78
001   小高  90   40  89
002   小婉  67  100  87

In [70]:
df.sort_index()   # 默认进行升序

    人物姓名  语文   数学  英语
001   小高  90   40  89
002   小婉  67  100  87
003   小明  88   60  78

In [71]:
df.sort_index(ascending=False)  # ascending=False则按索引降序

    人物姓名  语文   数学  英语
003   小明  88   60  78
002   小婉  67  100  87
001   小高  90   40  89

### df.sort_values()  按照值进行排序

In [72]:
df

    人物姓名  语文   数学  英语
003   小明  88   60  78
001   小高  90   40  89
002   小婉  67  100  87

In [73]:
df.sort_values(by='语文', ascending=False)  #按照语文进行降序

    人物姓名  语文   数学  英语
001   小高  90   40  89
003   小明  88   60  78
002   小婉  67  100  87

In [74]:
df.sort_values(['数学', '语文'], ascending=[True, False]) 


# 这种写法是先按照数学进行升序， 在数学一样的情况下再按照语文进行降序

    人物姓名  语文   数学  英语
001   小高  90   40  89
003   小明  88   60  78
002   小婉  67  100  87

### df.drop_duplicates(subset=['A','B'],keep='first',inplace=True)删除重复行  
- 代码中subset对应的值是列名，表示只考虑这两列，将这两列对应值相同的行进行去重。默认值为subset=None表示考虑所有列。
- keep='first'表示保留第一次出现的重复行，是默认值。keep另外两个取值为"last"和False，分别表示保留最后一次出现的重复行和去除所有重复行。
- inplace=True表示直接在原来的DataFrame上删除重复项，而默认值False表示生成一个副本。

In [75]:
df = pd.DataFrame({'姓名':['李四', '张三', '李四', '王五'], 
                   '语文':[78, 90, 78, np.nan]})

In [76]:
df

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   NaN

In [77]:
df.drop_duplicates()  # 去重

   姓名    语文
0  李四  78.0
1  张三  90.0
3  王五   NaN

### df.isnull()/df.isna()查看缺失值情况

In [78]:
df

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   NaN

In [79]:
df.isna()

      姓名     语文
0  False  False
1  False  False
2  False  False
3  False   True

In [80]:
df.isnull().sum()  # 统计每一列的缺失值个数

姓名    0
语文    1
dtype: int64

In [81]:
df.isnull().sum()/df.shape[0]  # 统计每一列的缺失值占比

姓名    0.00
语文    0.25
dtype: float64

### df.duplicated()     
判断每一行是不是重复值

In [84]:
df

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   NaN

In [85]:
df.duplicated()

0    False
1    False
2     True
3    False
dtype: bool

### df.fillna()缺失值填充

In [87]:
df.fillna(0)

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五   0.0

In [88]:
 df.fillna(df.语文.mean())

   姓名    语文
0  李四  78.0
1  张三  90.0
2  李四  78.0
3  王五  82.0

### df.apply()   
df.apply(func, axis=0, raw=False, result_type=None, args=(), **kwds)  
Func：应用于每一列或每一行的函数函数  
axis：轴向{0 or 'index', 1 or 'columns'}, 0或“index”：将函数应用于每一列。1或“列”：将函数应用于每一行。  
raw:bool, default False.`False‘：将每一行或每一列作为Series传递给函数。` `True‘：传递的函数将接收ndarray对象`当然如果是ndarray性能更加 result_type：返回结果的设定， 会自动匹配最好的数据类型进行返回， 默认就行。  
args:给func的位置参数元祖。
**args:给func的关键字参数

In [98]:
df.apply?

In [100]:
a = np.random.randint(60, 100, (10, 6))
a = pd.DataFrame(a)
a.columns = ['语文', '数学', '英语', '物理', '化学', '生物']
a.index = ['A'+i for i in '0123456789']
a

    语文  数学  英语  物理  化学  生物
A0  81  78  83  96  94  77
A1  84  96  95  80  71  80
A2  83  88  63  92  88  74
A3  62  79  65  68  99  66
A4  90  91  66  90  78  96
A5  76  79  70  83  93  74
A6  97  60  68  62  74  93
A7  87  62  70  63  81  85
A8  92  99  95  67  83  66
A9  93  86  94  85  72  85

In [101]:
# 计算每科的平均分
np.mean(a.语文)

84.5

In [104]:
a.apply(np.mean, axis=0)  # 对每一列进行操作

语文    84.5
数学    81.8
英语    76.9
物理    78.6
化学    83.3
生物    79.6
dtype: float64

In [105]:
# 计算每个人的总分
a.apply(np.sum, axis=1)

A0    509
A1    506
A2    488
A3    439
A4    511
A5    475
A6    454
A7    448
A8    502
A9    515
dtype: int64

### df.applymap()

In [107]:
df.applymap?

In [108]:
# 将分数变成等级
#   >=90  优
#   >=80  良
#   >=70  中
#   >=60   及格

In [109]:
def func(x):
    if x>=90:
        return '优'
    elif x>=80:
        return '良'
    elif x>=70:
        return '中'
    elif x>=60:
        return '及格'
    else:
        return '不及格'

In [110]:
a.applymap(func)

    语文  数学  英语  物理 化学  生物
A0   良   中   良   优  优   中
A1   良   优   优   良  中   良
A2   良   良  及格   优  良   中
A3  及格   中  及格  及格  优  及格
A4   优   优  及格   优  中   优
A5   中   中   中   良  优   中
A6   优  及格  及格  及格  中   优
A7   良  及格   中  及格  良   良
A8   优   优   优  及格  良  及格
A9   优   良   优   良  中   良